src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мрРасчетСреднегоЧекаПоПродавцам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаМАП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаШафл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Documents/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Продажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.мрДанные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продавцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товар</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам/Forms/ФормаГенерацииДанных/Ext/Form/Module.bsl
&НаКлиенте
Процедура Генерировать(Команда)
	ГенерироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКэшОбъектов()
	
	КэшОбъектов	= Новый Соответствие;
	ЗаполнитьИзСправочника(КэшОбъектов, Метаданные.Справочники.Города);
	ЗаполнитьИзСправочника(КэшОбъектов, Метаданные.Справочники.Товар);
	ЗаполнитьИзСправочника(КэшОбъектов, Метаданные.Справочники.Продавцы);
	
	Возврат КэшОбъектов;
	
КонецФункции

&НаСервере
Процедура ГенерироватьНаСервере()
	
	КэшОбъектов = ПолучитьКэшОбъектов();
	Гсч = Новый ГенераторСлучайныхЧисел();
	ИмяГорода = "Город";
	ШагВремени = (ДатаОкончания - ДатаНачала)/КоличествоДокументов;
	
	Для счДокументов = 1 По КоличествоДокументов Цикл
		ДатаДокумента = ДатаНачала + счДокументов * ШагВремени;
		
		Документ = Документы.Продажи.СоздатьДокумент();
		Документ.Дата = ДатаДокумента;
		Город = ПолучитьЗначениеИзКоллекции(Гсч, ИмяГорода, КэшОбъектов);		
		Продавец = ПолучитьЗначениеИзКоллекции(Гсч, "Продавец", КэшОбъектов);
		Документ.Город = Город;
		Документ.Продавец = Продавец;
		Для счСтрок = 1 По КоличествоСтрокВДокументе Цикл
			
			Новая = Документ.Состав.Добавить();
			Товар = ПолучитьЗначениеИзКоллекции(Гсч, "Товар", КэшОбъектов);					
			
			Новая.Товар = Товар;
			Новая.Количество = гсч.СлучайноеЧисло(1, 50);
			Новая.Сумма = гсч.СлучайноеЧисло(1, 10000000)/10000;
		КонецЦикла;
		Документ.Состав.Свернуть("Товар", "Количество, Сумма");
		Для каждого строкаТЧ Из Документ.Состав Цикл
			СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
		КонецЦикла;
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеИзКоллекции(Гсч, Знач ИмяТаблицы, КэшОбъектов)
	
	Возврат КэшОбъектов [ИмяТаблицы] [Гсч.СлучайноеЧисло(0, КэшОбъектов [ИмяТаблицы].КОличество()-1)].Ссылка;

КонецФункции

&НаСервере
Функция ЗаполнитьИзСправочника(КэшОбъектов, Менеджер)
	
	ИмяСправочника = Менеджер.Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.%1 КАК Спр", ИмяСправочника);
	
	РезультатЗапроса = Запрос.Выполнить();
	КэшОбъектов.Вставить(ИмяСправочника, РезультатЗапроса.Выгрузить());

КонецФункции
